# 05_Working with text Data

In [1]:
import pandas as pd

In [2]:
chicago = pd.read_csv("chicago.csv")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [11]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null object
Employee Annual Salary    32062 non-null object
dtypes: object(4)
memory usage: 1002.0+ KB

**Ê≥®ÊÑè unique Âíå count** ÁöÑÂå∫Âà´

In [7]:
chicago["Department"].nunique()

35

In [8]:
chicago["Department"].count()

32062

In [12]:
chicago = pd.read_csv("chicago.csv")
chicago['Department'] = chicago["Department"].astype("category")
chicago.head(3)
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

Ê≥®ÊÑè memory usuage ‰∏Ä‰∏ãÂ≠êÂáèÂ∞ë‰∫ÜÂæàÂ§öÔºåÊâÄ‰ª•ÂÆûÈôÖÂ∑•‰Ωú‰∏≠Ë¶ÅÂ∞ΩÈáè‰ΩøÁî®Âπ≤Ëøô‰∏™ÊñπÊ≥ï

##  2. Common String Methods lower, upper, title, and len
### 2.1 Traditional Python String

In [13]:
"HELLO, WORLD".lower()

'hello, world'

In [14]:
"hello, world".upper()

'HELLO, WORLD'

In [15]:
"hello, world".title() # Capitalize first letter of every word

'Hello, World'

In [16]:
len("hello, world")

12

### 2.2 string in pandas
Ê≥®ÊÑè‰∏çËÉΩÁõ¥Êé•‰ΩøÁî®.upper ÂøÖÈ°ªË¶ÅÂëäËØâ pandas ËøôÊòØ stringÔºåÊâÄ‰ª•ÈúÄË¶Å‰∏Ä‰∏™ str ÂâçÁºÄ

In [17]:
chicago = pd.read_csv("chicago.csv")

In [19]:
chicago['Name'].head()

0        AARON,  ELVIA J
1      AARON,  JEFFERY M
2         AARON,  KARINA
3    AARON,  KIMBERLEI R
4    ABAD JR,  VICENTE M
Name: Name, dtype: object

In [20]:
chicago['Name'].title().head()

AttributeError: 'Series' object has no attribute 'title'

In [21]:
chicago['Name'].str.title().head()

0        Aaron,  Elvia J
1      Aaron,  Jeffery M
2         Aaron,  Karina
3    Aaron,  Kimberlei R
4    Abad Jr,  Vicente M
Name: Name, dtype: object

In [22]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

**ÁúüÊ≠£ÊîπÂèò Column ÁöÑÊ†ºÂºè**

In [24]:
chicago['Name'] = chicago['Name'].str.title()
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
2,"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
3,"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

#### len ÁöÑÁâπÊÆä‰ΩøÁî®

In [25]:
len(chicago['Name']) # Ëøô‰∏™ÊòØ row ÁöÑÊï∞ÁõÆ

32063

In [28]:
chicago['Name'].str.len().head() # üòÇ ËøôÊ†∑ÂÜôÊÑüËßâÂ•ΩÂ•áÊÄ™

0    15.0
1    17.0
2    14.0
3    19.0
4    19.0
Name: Name, dtype: float64

## 3 The .str.replace() Method

### 3.1 Python Refresher

In [29]:
"Hello World".replace("World", "Wendong")

'Hello Wendong'

In [30]:
"Hello World".replace("l", "!")

'He!!o Wor!d'

In [31]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')

In [33]:
chicago['Department'] = chicago['Department'].astype("category")

In [34]:
chicago['Department'].head()

0         WATER MGMNT
1              POLICE
2              POLICE
3    GENERAL SERVICES
4         WATER MGMNT
Name: Department, dtype: category
Categories (35, object): [ADMIN HEARNG, ANIMAL CONTRL, AVIATION, BOARD OF ELECTION, ..., STREETS & SAN, TRANSPORTN, TREASURER, WATER MGMNT]

In [36]:
chicago['Department'].str.replace("MGMNT", "MANAGMENT").head()

0     WATER MANAGMENT
1              POLICE
2              POLICE
3    GENERAL SERVICES
4     WATER MANAGMENT
Name: Department, dtype: object

In [37]:
chicago['Department'] = chicago['Department'].str.replace("MGMNT", "MANAGMENT")

In [38]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGMENT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MANAGMENT,$106836.00

remove the dollar sign

ÂÖàË∞ÉËØï

In [42]:
chicago['Employee Annual Salary'].str.replace("$", "").astype(float).head()

0     90744.0
1     84450.0
2     84450.0
3     89880.0
4    106836.0
Name: Employee Annual Salary, dtype: float64

In [45]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].str.replace("$", "").astype(float)

In [47]:
chicago['Employee Annual Salary'].mean()

80204.17863389682

In [48]:
chicago['Employee Annual Salary'].std()

25098.32986750994

In [49]:
chicago['Employee Annual Salary'].nlargest(10)

8184     300000.0
7954     216210.0
25532    202728.0
8924     197736.0
8042     197724.0
19208    195000.0
3706     187680.0
18556    187680.0
29466    187680.0
13754    185364.0
Name: Employee Annual Salary, dtype: float64

In [ ]:
## Filtering with String Methods

## 4 Filtering with String Methods

### contains

In [50]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')
chicago['Department'] = chicago['Department'].astype("category")

In [53]:
chicago['Position Title'].head()

0            WATER RATE TAKER
1              POLICE OFFICER
2              POLICE OFFICER
3    CHIEF CONTRACT EXPEDITER
4           CIVIL ENGINEER IV
Name: Position Title, dtype: object

In [54]:
"hello wendong".contains("wendong")

AttributeError: 'str' object has no attribute 'contains'

* python Êú¨Ë∫´Ê≤°Êúâ contains ÊñπÊ≥ï
* pandas ‰ΩøÁî® contains ‰πãÂâç ÊúÄÂêéÁªü‰∏Ä lower case

In [55]:
chicago["Position Title"].str.lower().str.contains('water').head()

0     True
1    False
2    False
3    False
4    False
Name: Position Title, dtype: bool

In [56]:
mask = chicago["Position Title"].str.lower().str.contains('water')

In [58]:
chicago[mask].head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,$82044.00
685,"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MGMNT,$109272.00
702,"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00

### startswith( )

In [59]:
"wendong".startswith('w')

True

In [62]:
mask = chicago['Position Title'].str.lower().str.startswith('water')

In [63]:
chicago[mask].head()

                    Name    Position Title   Department Employee Annual Salary
0        AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
671      ANDER,  PERRY A  WATER CHEMIST II  WATER MGMNT              $82044.00
1054    ASHLEY,  KARMA T  WATER CHEMIST II  WATER MGMNT              $82044.00
1079   ATKINS,  JOANNA M  WATER CHEMIST II  WATER MGMNT              $82044.00
1181  AZEEM,  MOHAMMED A  WATER CHEMIST II  WATER MGMNT              $53172.00

### endswith

In [64]:
'wendong'.endswith('dong')

True

In [65]:
mask = chicago['Position Title'].str.lower().str.endswith('ist')

In [66]:
chicago[mask].head()

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",PSYCHIATRIST,HEALTH,$99840.00
308,"ALARCON, LUIS J",LOAN PROCESSING SPECIALIST,COMMUNITY DEVELOPMENT,$81948.00
422,"ALLAIN, CAROLYN",SENIOR TELECOMMUNICATIONS SPECIALIST,DoIT,$89880.00
472,"ALLEN, ROBERT",MACHINIST,WATER MGMNT,$94328.00
705,"ANDERSON, EDWARD M",SR PROCUREMENT SPECIALIST,PROCUREMENT,$91476.00

## 5 More String Methods: strip, lstrip, and rstrip

In [67]:
"       Hello Wendong    ".lstrip()

'Hello Wendong    '

In [68]:
"       Hello Wendong    ".rstrip()

'       Hello Wendong'

In [69]:
"       Hello Wendong    ".strip()

'Hello Wendong'

In [70]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')
chicago['Department'] = chicago['Department'].astype("category")

In [72]:
chicago['Name'].str.strip().head()

0        AARON,  ELVIA J
1      AARON,  JEFFERY M
2         AARON,  KARINA
3    AARON,  KIMBERLEI R
4    ABAD JR,  VICENTE M
Name: Name, dtype: object

In [73]:
chicago['Name'] = chicago['Name'].str.strip()

## 6 String Methods on Index and Columns

In [75]:
chicago = pd.read_csv("chicago.csv", index_col = 'Name').dropna(how = 'all')
chicago['Department'] = chicago['Department'].astype("category")

In [76]:
chicago.tail()

,Position Title,Department,Employee Annual Salary
Name,,,
"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

index ‰πãÂêéÂæóÂà∞ SeriesÔºå Series ‰πüÂèØ‰ª•ËøõË°å str Êìç‰Ωú

In [79]:
chicago.index

Index(['AARON,  ELVIA J', 'AARON,  JEFFERY M', 'AARON,  KARINA',
       'AARON,  KIMBERLEI R', 'ABAD JR,  VICENTE M', 'ABARCA,  ANABEL',
       'ABARCA,  EMMANUEL', 'ABASCAL,  REECE E', 'ABBASI,  CHRISTOPHER',
       'ABBATACOLA,  ROBERT J',
       ...
       'ZWIT,  JEFFREY J', 'ZWOLFER,  MATTHEW W', 'ZYCH,  MATEUSZ',
       'ZYDEK,  BRYAN', 'ZYGADLO,  JOHN P', 'ZYGADLO,  MICHAEL J',
       'ZYGOWICZ,  PETER J', 'ZYMANTAS,  MARK E', 'ZYRKOWSKI,  CARLO E',
       'ZYSKOWSKI,  DARIUSZ'],
      dtype='object', name='Name', length=32062)

In [80]:
chicago.index.str.strip().str.title()

Index(['Aaron,  Elvia J', 'Aaron,  Jeffery M', 'Aaron,  Karina',
       'Aaron,  Kimberlei R', 'Abad Jr,  Vicente M', 'Abarca,  Anabel',
       'Abarca,  Emmanuel', 'Abascal,  Reece E', 'Abbasi,  Christopher',
       'Abbatacola,  Robert J',
       ...
       'Zwit,  Jeffrey J', 'Zwolfer,  Matthew W', 'Zych,  Mateusz',
       'Zydek,  Bryan', 'Zygadlo,  John P', 'Zygadlo,  Michael J',
       'Zygowicz,  Peter J', 'Zymantas,  Mark E', 'Zyrkowski,  Carlo E',
       'Zyskowski,  Dariusz'],
      dtype='object', name='Name', length=32062)

In [81]:
chicago.index = chicago.index.str.strip().str.title()

In [82]:
chicago.tail()

,Position Title,Department,Employee Annual Salary
Name,,,
"Zygadlo, Michael J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
"Zygowicz, Peter J",POLICE OFFICER,POLICE,$87384.00
"Zymantas, Mark E",POLICE OFFICER,POLICE,$84450.00
"Zyrkowski, Carlo E",POLICE OFFICER,POLICE,$87384.00
"Zyskowski, Dariusz",CHIEF DATA BASE ANALYST,DoIT,$113664.00

columns ÁöÑÂêçÂ≠ó ‰πüÂèØ‰ª•Ëøô‰πàÂ§ÑÁêÜ

In [83]:
chicago.columns = chicago.columns.str.upper()

In [84]:
chicago.head()

,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

## 7 Split Strings by Characters with .str.split( ) Method

In [85]:
"hello my name is wendong".split(" ")

['hello', 'my', 'name', 'is', 'wendong']

In [94]:
"hello my name is wendong".split(" ").get(-1)

AttributeError: 'list' object has no attribute 'get'

In [89]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')
chicago['Department'] = chicago['Department'].astype("category")

In [91]:
chicago['Name'].str.split(",").head()

0        [AARON,   ELVIA J]
1      [AARON,   JEFFERY M]
2         [AARON,   KARINA]
3    [AARON,   KIMBERLEI R]
4    [ABAD JR,   VICENTE M]
Name: Name, dtype: object

Ê≥®ÊÑèËøô‰∏™ÈÄóÂè∑Ôºå ÊòØsplit ‰πãÂêéÁî®Êù•ÂàÜÂâ≤ÂçïËØçÁöÑÈÄóÂè∑Ôºå‰∏çÊòØ‰πãÂâçÁöÑÈÄóÂè∑

In [95]:
chicago['Name'].str.split(",").str.get(1).str.title().head()

0          Elvia J
1        Jeffery M
2           Karina
3      Kimberlei R
4        Vicente M
Name: Name, dtype: object

In [97]:
chicago['Name'].str.split(",").str.get(1).str.title().value_counts().nlargest(5)

  Michael J    270
  Michael      165
  Michael A    158
  David        128
  Robert J     120
Name: Name, dtype: int64

In [99]:
chicago['Position Title'].str.split(" ").str.get(0).value_counts().nlargest(5)

POLICE             10856
FIREFIGHTER-EMT     1509
SERGEANT            1186
POOL                 918
FIREFIGHTER          810
Name: Position Title, dtype: int64

## 8 More Practice with Splits

In [100]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')
chicago['Department'] = chicago['Department'].astype("category")

In [101]:
chicago['Name'].str.split(",").str.get(1).str.title().value_counts().nlargest(5)

  Michael J    270
  Michael      165
  Michael A    158
  David        128
  Robert J     120
Name: Name, dtype: int64

Â¶Ç‰ΩïÊï¥ÁêÜËøô‰∫õ Âë¢

In [103]:
chicago['Name'].str.split(",").str.get(1).head()

0          ELVIA J
1        JEFFERY M
2           KARINA
3      KIMBERLEI R
4        VICENTE M
Name: Name, dtype: object

Âú®ËøõË°å‰∏ÄÊ¨° Split

In [105]:
chicago['Name'].str.split(",").str.get(1).str.split(" ").head()

0        [, , ELVIA, J]
1      [, , JEFFERY, M]
2          [, , KARINA]
3    [, , KIMBERLEI, R]
4      [, , VICENTE, M]
Name: Name, dtype: object

Ëøô‰∏™Âá∫Áé∞‰∫ÜÂ•áÊÄ™ÁöÑ‰∏úË•ø, Âõ†‰∏∫ YIN, WENDONG ‰∏ÄËà¨ÈÄóÂè∑ÂêéÈù¢ÈÉΩÊúâ‰∏Ä‰∏™Á©∫Ê†º„ÄÇÊâÄ‰ª•ÈúÄË¶Å‰∏Ä‰∏ã Strip

In [107]:
chicago['Name'].str.split(",").str.get(1).str.strip().str.split(" ").head()

0        [ELVIA, J]
1      [JEFFERY, M]
2          [KARINA]
3    [KIMBERLEI, R]
4      [VICENTE, M]
Name: Name, dtype: object

In [116]:
chicago['Name'].str.split(",").str.get(1).str.strip().str.split(" ").str.get(0).value_counts().head()

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
Name: Name, dtype: int64

## 9 The expand and n Parameters of the .str.split() Method

In [117]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')
chicago['Department'] = chicago['Department'].astype("category")

In [120]:
chicago["Name"].str.split(",").head()

0        [AARON,   ELVIA J]
1      [AARON,   JEFFERY M]
2         [AARON,   KARINA]
3    [AARON,   KIMBERLEI R]
4    [ABAD JR,   VICENTE M]
Name: Name, dtype: object

ÂÖàÊâ©Â±ïÊàê‰∏Ä‰∏™Â∞èÁöÑ dataframe ÔºåÁÑ∂ÂêéÂÜçÊãºÊé•Âú®Â§ßÁöÑ‰∏äÈù¢

In [124]:
chicago[['First Name', "Last Name"]] = chicago["Name"].str.split(",", expand = True).head()

In [125]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M

In [127]:
chicago['Position Title'].str.split(" ", expand = True).head()

        0         1          2     3     4     5     6     7     8
0   WATER      RATE      TAKER  None  None  None  None  None  None
1  POLICE   OFFICER       None  None  None  None  None  None  None
2  POLICE   OFFICER       None  None  None  None  None  None  None
3   CHIEF  CONTRACT  EXPEDITER  None  None  None  None  None  None
4   CIVIL  ENGINEER         IV  None  None  None  None  None  None

n = 1Ôºå Ââ©‰∏ãÊâÄÊúâÁöÑÂèòÊàê 1

In [128]:
chicago['Position Title'].str.split(" ", expand = True, n = 1).head()

        0                   1
0   WATER          RATE TAKER
1  POLICE             OFFICER
2  POLICE             OFFICER
3   CHIEF  CONTRACT EXPEDITER
4   CIVIL         ENGINEER IV

In [129]:
chicago['Position Title'].str.split(" ", expand = True, n = 2).head()

        0         1          2
0   WATER      RATE      TAKER
1  POLICE   OFFICER       None
2  POLICE   OFFICER       None
3   CHIEF  CONTRACT  EXPEDITER
4   CIVIL  ENGINEER         IV